thesis.org
#+title:  A Scalable and Decentralized Parking Management Solution for Multi-Community Deployment

* Set-up :ignore:
:properties:
:visibility: folded
:end:

** Configuration :noexport:
#+author: Andrés Navarro Pedregal
#+creator: Andrés Navarro Pedregal
#+bibliography: ./references.bib
#+latex_header: \newcommand{\degree}{Data Science and Engineering and Telecommunication Technologies Engineering}
#+latex_header: \newcommand{\graduationyear}{2024-2025}
#+latex_header: \newcommand{\supervisor}{David Larrabeiti López}
#+latex_header: \newcommand{\placeandyear}{Leganés, 2025}
#+language: en
#+options: title:nil toc:nil tags:nil
#+latex_class: book
#+latex_class_options: [oneside, 12pt, a4paper, draft]
#+latex_header: \makeatletter
#+latex_header: \def\input@path{{./templates/thesis/}}
#+latex_header: \graphicspath{{./figures} {./logos} {./templates/thesis/figures}}
#+latex_header: \makeatother
#+latex_header: \usepackage{thesis_uc3m}

** Title :ignore:
#+latex: \frontmatter
#+latex: \maketitle
#+latex: \blankpage

** Abstract :ignore:
#+latex: \chapter*{Abstract}

#+BEGIN_abstract
  this is an abstract
#+END_abstract

*Keywords:* .

#+latex: \blankpage

** Acknowledgments :ignore:
#+latex: \chapter*{Acknowledgments}
#+latex: \begingroup
#+latex: \let\clearpage\relax % This temporarily disables \clearpage

Thanks

#+latex: \chapter*{Agradecimientos}

Gracias

#+latex: \endgroup
#+latex: \blankpage

** Table of Contents :ignore:
#+latex: \chapter*{Table of Contents}

#+latex: \makeatletter
#+latex: \@starttoc{toc}
#+latex: \vskip 1.0em \@plus\p@
#+latex: \makeatother

#+latex: \blankpage

** List of Figures :ignore:
#+latex: \chapter*{List of Figures}

#+latex: \blankpage

** List of Tables :ignore:
#+latex: \chapter*{List of Tables}

#+latex: \blankpage

** Acronyms :ignore:
#+latex: \chapter*{Acronyms}

#+latex: \blankpage

** Nomenclature :ignore:
#+latex: \chapter*{Nomenclature}

** End of frontmatter :ignore:
#+latex: \mainmatter
* Introduction
** General understanding and relevance of parking management systems
In recent years, the exponential increase in the number of vehicles has aggravated urban challenges, notably in parking management. For instance, the surge in car usage in Madrid has significantly contributed to an increase in pollution levels [cite:@environmental_imapct_madrid_central]. Despite a stable number of parking spaces in Spain between 2014 and 2020 [cite:@urban_mobility_trends], the demand has led to higher costs and greater difficulty in securing parking, thereby increasing time spent searching for spaces, traffic congestion, and urban pollution.

TODO: explain what is a parking management system

Current parking management in Spain predominantly relies on human intervention, where personnel are responsible for regulating access to parking spaces. This manual approach often results in delays, inadequate information dissemination, and inefficient control over parking availability.

Advancements in technology offer promising solutions to these issues. The proliferation of internet-connected devices, which have grown by 20% year-over-year [cite:@iot_growth], has facilitated the development of Internet of Things (IoT)-based parking management systems. These systems aim to mitigate traffic congestion and reduce pollution in urban areas.

A parking management system (PMS) is designed to optimize the utilization of parking spaces within a city, community, or building. The primary objectives of a PMS include automating parking space management, recording vehicle transit, and enhancing overall operational efficiency.

PMSs provide numerous benefits in modern urban settings. They contribute to reducing traffic congestion and pollution, thereby improving urban mobility and the quality of life for residents. Additionally, PMSs enhance security by monitoring vehicle movements within parking areas, which aids in crime prevention.

These systems share several common features:
- Automation of parking space management.
- Application in various areas such as cities, communities, or buildings.
- Documentation of vehicle transit within parking spaces.

The integration of PMSs into urban infrastructure not only addresses parking-related issues but also aligns with broader smart city initiatives aimed at enhancing urban living conditions.

** Motivation
Parking management systems remain a critical area of research and development, even though manual parking management has been utilized for many years. Research published in [cite:@parking_choices] indicates that the type of parking management system significantly influences the parking choices of citizens. Additionally, citizens tend to prefer systems that are user-friendly, secure, and reliable.

Currently, parking management systems in Spain largely rely on human intervention, leading to several issues such as delays in availability, lack of information, and insufficient control of parking spaces. Continuous human presence is required to maintain the functionality of these systems throughout the day, which increases operational costs.

To address these issues, recent technological advancements have emerged. For instance:
- RFID-based smart parking management systems [cite:@rfid_smart_parking_management_system] have been developed to manage the transit of vehicles within parking spaces.
- IoT-based smart parking management systems [cite:@development_smart_parking_management_system] have been designed to manage parking spaces within a community.
- Intelligent parking systems utilizing image processing [cite:@intelligent_parking_system_image_processing] have been proposed to recognize license plates of parked vehicles.

Despite these advancements, several challenges persist. Current parking management systems are typically centralized, which presents scalability and reliability issues in the event of service interruptions. Additionally, these systems often lack customization options, making it difficult to adapt to user-specific needs.

Given these challenges, the primary objective of this project is to design and implement a fully distributed parking management system that addresses the limitations of current systems, focusing on enhancing scalability, reliability, and user adaptability.

** Objectives
The primary objective of this bachelor thesis is to design and implement a fully distributed parking management system tailored for the next generation of smart cities. This project aims to address the inefficiencies and challenges inherent in current parking management systems through a distributed approach that leverages modern technologies.

Specifically, the objectives of this project are as follows:

1. *Research Current Systems*: Conduct a comprehensive study of existing parking management systems, identifying their main problems. This involves understanding user requirements, analyzing the technologies employed, and evaluating system effectiveness.

2. *Technology Analysis*: Analyze the technologies currently used in parking management systems to determine their suitability for a distributed architecture. This includes examining sensors, Internet of Things (IoT) devices, communication protocols, and data processing methods.

3. *System Infrastructure Design*: Design the overall infrastructure of the distributed parking management system. This encompasses defining the system architecture, selecting appropriate technologies, and developing detailed design specifications.

4. *System Development*: Develop the system by adhering to a structured methodology that includes phases of planning, design, implementation, testing, deployment, and maintenance. Each phase will follow best practices to ensure the system's robustness and efficiency.

5. *Performance Analysis*: Evaluate the implemented system based on various criteria such as performance, scalability, security, usability, reliability, availability, and cost. This comprehensive analysis will help in assessing the effectiveness of the system and identifying areas for improvement.

Through these objectives, the thesis aims to contribute to the advancement of smart city technologies by providing a scalable, secure, and user-friendly parking management solution. The distributed nature of the proposed system is expected to enhance its performance and reliability, making it a viable option for modern urban environments.

** Outline of the work
This thesis is structured into several comprehensive chapters, each targeting specific objectives and tasks essential to the development of a distributed parking management system for smart cities.

The first chapter provides an in-depth study of existing parking management systems, focusing on their features and identifying key issues. This analysis serves as the foundation for understanding the requirements and challenges faced in current systems.

The second chapter delves into the technologies that can be employed to create a distributed parking management system. It encompasses an initial evaluation of both software and hardware components, along with the necessary infrastructure to support such a system.

The third chapter covers the implementation phase of the project. It follows a systematic methodology that includes planning, design, implementation, testing, deployment, and maintenance.

In the fourth chapter, the results of the implemented system are thoroughly analyzed. This analysis includes assessments of performance, scalability, security, usability, reliability, availability, and costs. Each aspect is evaluated using appropriate metrics and benchmarks to provide a comprehensive understanding of the system's effectiveness.

Finally, the fifth chapter presents the conclusions drawn from the research and development process. It also outlines potential future work, considering advancements that could further enhance the system. Additionally, this chapter discusses the socio-economic impact and regulatory framework relevant to the deployment of a distributed parking management system in smart cities.

