thesis.tex
% Created 2024-07-23 Tue 09:27
% Intended LaTeX compiler: pdflatex
\documentclass[oneside, 12pt, a4paper, draft]{book}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\newcommand{\degree}{Data Science and Engineering and Telecommunication Technologies Engineering}
\newcommand{\graduationyear}{2024-2025}
\newcommand{\supervisor}{David Larrabeiti López}
\newcommand{\placeandyear}{Leganés, 2025}
\makeatletter
\def\input@path{{./templates/thesis/}}
\graphicspath{{./figures} {./logos} {./templates/thesis/figures}}
\makeatother
\usepackage{thesis_uc3m}
\author{Andrés Navarro Pedregal}
\date{\today}
\title{A Scalable and Decentralized Parking Management Solution for Multi-Community Deployment}
\hypersetup{
 pdfauthor={Andrés Navarro Pedregal},
 pdftitle={A Scalable and Decentralized Parking Management Solution for Multi-Community Deployment},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Andrés Navarro Pedregal}, 
 pdflang={English}}
\usepackage{biblatex}
\addbibresource{./references.bib}
\begin{document}

\frontmatter
\maketitle
\blankpage
\chapter*{Abstract}

\begin{abstract}
this is an abstract
\end{abstract}

\textbf{Keywords:} .

\blankpage
\chapter*{Acknowledgments}
\begingroup
\let\clearpage\relax % This temporarily disables \clearpage

Thanks

\chapter*{Agradecimientos}

Gracias

\endgroup
\blankpage
\chapter*{Table of Contents}

\makeatletter
\@starttoc{toc}
\vskip 1.0em \@plus\p@
\makeatother

\blankpage
\chapter*{List of Figures}

\blankpage
\chapter*{List of Tables}

\blankpage
\chapter*{Acronyms}

\blankpage
\chapter*{Nomenclature}
\mainmatter
\part{Introduction}
\label{sec:org5c466b2}
\chapter{General understanding and relevance of parking management systems}
\label{sec:org2e7d34c}
In recent years, the exponential increase in the number of vehicles has aggravated urban challenges, notably in parking management. For instance, the surge in car usage in Madrid has significantly contributed to an increase in pollution levels \autocite{environmental_imapct_madrid_central}. Despite a stable number of parking spaces in Spain between 2014 and 2020 \autocite{urban_mobility_trends}, the demand has led to higher costs and greater difficulty in securing parking, thereby increasing time spent searching for spaces, traffic congestion, and urban pollution.

TODO: explain what is a parking management system

Current parking management in Spain predominantly relies on human intervention, where personnel are responsible for regulating access to parking spaces. This manual approach often results in delays, inadequate information dissemination, and inefficient control over parking availability.

Advancements in technology offer promising solutions to these issues. The proliferation of internet-connected devices, which have grown by 20\% year-over-year \autocite{iot_growth}, has facilitated the development of Internet of Things (IoT)-based parking management systems. These systems aim to mitigate traffic congestion and reduce pollution in urban areas.

A parking management system (PMS) is designed to optimize the utilization of parking spaces within a city, community, or building. The primary objectives of a PMS include automating parking space management, recording vehicle transit, and enhancing overall operational efficiency.

PMSs provide numerous benefits in modern urban settings. They contribute to reducing traffic congestion and pollution, thereby improving urban mobility and the quality of life for residents. Additionally, PMSs enhance security by monitoring vehicle movements within parking areas, which aids in crime prevention.

These systems share several common features:
\begin{itemize}
\item Automation of parking space management.
\item Application in various areas such as cities, communities, or buildings.
\item Documentation of vehicle transit within parking spaces.
\end{itemize}

The integration of PMSs into urban infrastructure not only addresses parking-related issues but also aligns with broader smart city initiatives aimed at enhancing urban living conditions.
