thesis.tex
\section{User Requirements}
\label{sec:org5f7294f}
The user requirements for the distributed parking management system were identified through a comprehensive analysis of the needs and preferences of drivers, parking facility managers, city administrators and users with disabilities.
These requirements were essential to ensure that the system was user-friendly, efficient, and aligned with the objectives of smart city initiatives \autocite{smart_cities_initiatives}.

The requirements of the primary users were as follows:

For drivers, the system needed to provide real-time information about available parking spaces to minimize search time.
This was crucial to reduce traffic congestion and pollution in urban areas.
Moreover, drivers expected an easy-to-use interface for quick navigation and more importantly, automatic functionality of the system without the need for human intervention.
That way, they did not have to worry about the availability of parking spaces and could focus on other tasks.

Parking facility managers required tools to monitor and manage their facilities efficiently, as well as access to detailed reports and analytics on parking usage patterns to optimize space utilization.
A notification system for intrusions such as unauthorized parking or security breaches was also essential to ensure the safety of the parking facilities.
Enhanced security measures, including surveillance and access control, were a must-have for them.

On the other hand, city administrators needed a system that could provide insights into parking demand and usage trends to inform urban planning decisions.
The system should support the integration of parking data with other smart city initiatives to enhance overall urban mobility and sustainability.
Moreover, city administrators required tools to monitor and minimize the environmental impact of parking facilities, such as reducing emissions and energy consumption.
The system should also comply with local regulations and standards for data privacy and security such as GDPR \autocite{gdpr}.

Finally, users with disabilities needed accessibility features such as voice commands, screen readers, and other assistive technologies to ensure that they could use the system effectively.
These features were essential to promote inclusivity and ensure that all users could benefit from the distributed parking management system.
Moreover, the system should be designed to accommodate users with different needs and preferences, ensuring a seamless user experience for everyone.
\section{System Requirements}
\label{sec:orgeed0ee1}
For the distributed parking management system to meet the user requirements, it had to incorporate specific system requirements.
These requirements were defined to ensure that the system was scalable, reliable, secure, and user-friendly, aligning with the objectives of smart city initiatives as well as the needs of drivers, parking facility managers, and city administrators.
The system requirements were essential to guide the design and development of the distributed parking management system, ensuring that it met the expectations of all stakeholders and delivered the desired outcomes.

The main system requirements were as follows:

For the real-time monitoring of parking space availability, the system needed to incorporate sensors and IoT devices to detect vehicle presence and occupancy.
These sensors had to be accurate, reliable, and cost-effective to provide up-to-date information on parking availability.

Reservation was another key requirement, allowing drivers to be assigned a specific number of parking spaces in advance to ensure that they could secure a spot when needed.
The reservation system had to be integrated with the monitoring system to ensure that drivers could find available spaces.

The system also needed to be self-sufficient, with automated gate and barrier control to regulate access to parking facilities.
It had to be capable of managing multiple parking facilities simultaneously, ensuring that drivers could access the system from different locations.
And it had to be able to function without human intervention, reducing the need for manual oversight.

Moreover, the system had to be scalable and flexible, with a distributed architecture that could handle large volumes of data and a growing number of users.
It had to support additional number of communities and parking facilities, ensuring that it could adapt to changing requirements.
For the system to be effective, modularity was essential, allowing for easy updates and integration of new features as needed.

Security and availability were critical requirements for the system, ensuring that the system was robust and resilient against cyber threats and service interruptions.
Interoperability was crucial to ensure compatibility with existing and future smart city infrastructure.

Finally, the user interface had to be intuitive and user-friendly, with mobile accessibility for drivers and web-based interfaces for facility managers and city administrators.
And accessibility features were needed to support users with disabilities, ensuring that the system was inclusive and accessible to all.
\chapter{{\bfseries\sffamily STRT} Overview and Architecture}
\label{sec:org499902e}
The distributed parking management system was designed to address the limitations of current parking management systems, focusing on addressing the user and system requirements identified in the previous section.
For this purpose, a comprehensive architecture was developed to ensure that the system was scalable, reliable, and user-friendly providing a new approach to parking management in smart cities.

For the distributed parking management system to meet the user requirements and system requirements, a detailed overview and architecture were defined.

The overview of the distributed parking management system provided a high-level description of the system components, functionalities, and interactions.
This overview served as a roadmap for the development of the system, guiding the design and implementation of the architecture.
